9/data/attachments/d25a97446ac94f8a.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_c7d0945f-1585-4d18-8a83-78dd6ba0f2f5</nif:username>
            <nif:friendToBeAdded>Joshua_election_Friend_14146_6</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>